import React from "react";

const About = () => {
  return (
    <section className="p-6 max-w-5xl mx-auto text-justify leading-8">
      <h2 className="text-3xl font-bold mb-4 text-blue-800 text-center">विद्यालय के बारे में</h2>
      <p className="text-gray-800 whitespace-pre-line">
        पीएम श्री शासकीय उच्चतर माध्यमिक विद्यालय आदेगांव की स्थापना सन 1965 में की गई है। 
        यह जनजातीय सामाजिक कल्याण विभाग द्वारा संचालित किया जाता है। विद्यालय ग्रामीण क्षेत्र में स्थित है 
        और सिवनी जिले के लखनादौन ब्लॉक में आता है। यह विद्यालय कक्षा नर्सरी से 12वीं तक शिक्षा प्रदान करता है 
        और यहां शिक्षा प्रणाली पर आधारित है। इसमें छात्र एवं छात्राएं दोनों शिक्षा ग्रहण करते हैं।

        विद्यालय में प्री-प्राइमरी (पूर्व-प्राथमिक) अनुभाग भी संलग्न है। विद्यालय का भवन बड़ा होने के कारण 
        सभी कक्षाएं एक ही शिफ्ट में लगती हैं। विद्यालय में शिक्षा का माध्यम हिंदी है और यहां पर सड़कों की 
        व्यवस्था अच्छी होने के कारण विद्यार्थियों को पहुंचने में कोई दिक्कत नहीं होती। यहां शैक्षणिक सत्र 
        अप्रैल माह से प्रारंभ होता है।

        विद्यालय का भवन सरकारी है, जिसमें दो कक्ष ऑफिस के रूप में उपयोग होते हैं जिससे शिक्षण कार्य की देखरेख होती है। 
        इसके अतिरिक्त दो अन्य कक्ष गैर-शिक्षकीय कार्यों जैसे सांस्कृतिक कार्यक्रम एवं भारत पर्व आदि के लिए हैं। 
        प्रधान अध्यापकों एवं शिक्षकों के लिए अलग से स्टाफ रूम उपलब्ध है। विद्यालय चारों ओर से बाउंड्री द्वारा सुरक्षित है।

        यहां पर विद्युत व्यवस्था भी अच्छी है। पेयजल की उत्तम व्यवस्था है। विद्यालय में छात्र और छात्राओं के लिए 
        अलग-अलग दो-दो शौचालय हैं। विद्यालय में एक विशाल खेल का मैदान है। साथ ही विद्यालय में पुस्तकालय है, 
        जिसमें लगभग 4500 पुस्तकें हैं।

        विद्यालय में बच्चों को तकनीकी शिक्षा के लिए कंप्यूटर लैब (ICT) भी उपलब्ध है। 
        विद्यालय में विद्यार्थियों के लिए भौतिक प्रयोगशाला, रसायन प्रयोगशाला, जीवविज्ञान प्रयोगशाला 
        तथा स्मार्ट क्लास भी उपलब्ध हैं।
      </p>
    </section>
  );
};

export default About;
